export const ua = {
    login: {
        title: "Логін",
        email: "Пошта",
        password: "Пароль",
        dont_have_account: "Нема аккаунта? Створіть ЙОГО!",
        button_login: "Впустіть мене",
        emailPlaceholder: "Введіть вашу пошту",
        passwordPlaceholder: "Введіть ваш пароль",
        incorrectEmail: "Некоректна пошта",
        requiredEmail: "Пошта обов'язкова",
        requiredPassword: "Пароль обов'язковий"
    },
    signup: {
        title: "Реєстрація",
        email: "Пошта",
        password: "Пароль",
        already_have_account: "Вже є аккаунт? Увійдіть",
        button_signup: "Зареєструватися",
        emailPlaceholder: "Введіть вашу пошту",
        passwordPlaceholder: "Введіть ваш пароль",
        incorrectEmail: "Некоректна пошта",
        requiredEmail: "Пошта обов'язкова",
        requiredPassword: "Пароль обов'язковий",
        shortPassword: "Пароль занадто короткий"
    },
    errors: {
        'auth/user-not-found': 'Користувача не знайдено',
        'auth/wrong-password': 'Неправильний пароль',
        'auth/email-already-in-use': 'Пошта вже використовується',
        'auth/weak-password': 'Слабкий пароль',
        'auth/invalid-email': 'Некоректна пошта',
        error: 'Помилка'
    },
    tabs: {
        moodDiary: "Щоденник настрою",
        test: "Тест",
        progress: "Прогрес",
    },
    mood: {
        today: "Сьогодні",
        newEntry: "Новий запис",
        addEntry: "Додати запис",
        editEntry: "Редагувати запис",
        emotionsBefore: "Які емоції ви відчували до цього?",
        emotionsAfter: "Які емоції ви відчуваєте зараз?",
        automaticThoughts: "Автоматичні думки",
        cognitiveDistortions: "Когнітивні спотворення",
        rationalResponse: "Раціональна відповідь",
        viewRecord: "Перегляд запису",
        editRecord: "Редагування запису",
        noRecordsTitle: "За сьогодні записів немає",
        noRecordsText: "Почніть з додавання нового запису",
        before: 'До',
        after: 'Після',
        emotions: [
            "Байдужість", "Безпорадність", "Безсилля", "Натхнення", "Вина", "Обурення", "Збудження", "Захоплення", "Екстаз", "Захоплення",
            "Зарозумілість", "Гнів", "Гордість", "Смуток", "Роздратування", "Шкода", "Турбота", "Заздрість", "Інтерес", "Підлабузництво", "Спантеличеність",
            "Зверхність", "Сором'язливість", "Зловтіха", "Злість", "Здивування", "Інтерес", "Іронія", "Страх", "Ликовання", "Лукавство", "Замилування",
            "Цікавість", "Мольфа", "Похмурість", "Надія", "Зверхність", "Напруга", "Пильність", "Неворушимість", "Обурення", "Ніжність",
            "Незграбність", "Нетерплячість", "Розгубленість", "Образа", "Зреченість", "Стурбованість", "Бешкет", "Відраза", "Ображеність",
            "Обережність", "Відраза", "Жах", "Відчуженість", "Відокремленість", "Відчай", "Оціпеніння", "Смуток", "Плаксивість", "Пригніченість",
            "Підозрілість", "Покірність", "Покровительство", "Порив", "Загубленість", "Перевага", "Передчуття", "Зневага",
            "Зневажливість", "Допитливість", "Радість", "Роздратування", "Розсіяність", "Збентеженість", "Запал", "Сарказм", "Смуток", "Нудьга", "Сміх",
            "Сором", "Замішання", "Зібраність", "Жаль", "Спокій", "Стриманість", "Страждання", "Страх", "Прагнення", "Сором", "Тривога",
            "Тремтіння", "Захоплення", "Здивування", "Задоволення", "Задоволення", "Пригніченість", "Захоплення", "Спокій", "Смуток", "Наполегливість",
            "Втома", "Царственість", "Ейфорія", "Екзальтація", "Екстаз", "Енергійність", "Ентузіазм", "Лютість"
        ],
        distortionsList: [ "Усе або нічого", "Надузагальнення", "Негативний фільтр", "Знецінення позитивного", "Поспішні висновки", "Перебільшення та применшення", "Емоційне обґрунтування", "Твердження зі словом \"мушу\"", "Навішування ярликів (самоклеймення)", "Персоналізація" ]
    },
    test: {
        testOptions: [ 'Зовсім ні', 'Трохи', 'Помірно', 'Сильно', 'Дуже' ],
        copy: `
Для того щоб відстежувати прогрес
вилікування депресії, розумна людина Девід Бернс придумав простий тест на 25 питань, який досить точно може визначити рівень вашої депресії.

Гарною ідеєю буде проходити його раз на тиждень, для розуміння, допомагають вам ваші способи лікування,
або ж потрібно щось змінювати`,
        questions: [
            "У вас поганий настрій?",
            "Ви відчуваєте себе нещасним?",
            "Ви відчуваєте бажання розплакатися або кричати?",
            "Ви відчуваєте розчарованість своїм життям?",
            "Ви відчуваєте почуття безнадійності?",
            "Ви відчуваєте низьку самооцінку?",
            "Ви відчуваєте себе марним?",
            "Ви відчуваєте почуття провини або сорому?",
            "Ви звинувачуєте в бідах самого себе або, навпаки, звинувачуєте інших?",
            "Ви відчуваєте труднощі з прийняттям рішень?",
            "Ви відчуваєте втрату інтересу до членів сім'ї, друзів, колег?",
            "Ви відчуваєте самотність?",
            "Ви проводите менше часу з сім'єю або з друзями?",
            "Ви відчуваєте втрату мотивації?",
            "Ви відчуваєте втрату інтересу до роботи або інших занять?",
            "Ви уникаєте роботи та іншої діяльності?",
            "Ви відчуваєте втрату задоволення і брак задоволення від життя?",
            "Ви відчуваєте втому?",
            "Ви відчуваєте труднощі зі сном або, навпаки, спите занадто багато?",
            "Ви маєте знижений або, навпаки, підвищений апетит?",
            "Ви помічаєте втрату інтересу до сексу?",
            "Ви турбуєтеся з приводу свого здоров'я?",
            "Чи є у вас суїцидальні думки?",
            "Чи хотіли б ви закінчити своє життя?",
            "Чи плануєте ви нашкодити собі?"
        ],


        title: 'Тест Бернса',
        blockerInfo: (nextDate) => "Ви вже проходили тест на цьому тижні. Наступного разу можна буде пройти " + nextDate,

        takeTest: 'Пройти тест',
        showProgress: 'Подивитися прогрес',
        testResult: 'Результати тесту',
        toResults: 'До результатів',
    },
}